"""
Напишите цикл for, который выводит код ASCII каждого символа в строке поимени S.
"""
_str ='abcdaefghijklmnopqrstuvyxwz'
for i in _str:
    print(ord(i))
