# Дан список чисел. Вычислить сумму всех чисел: с for-циклом, с while-циклом.
# Результаты вывести на экран.

_list = [1,2,3]
a = 0
for i in _list:
    a += i
print('Сумма равна', a)
