# Дано два списка, например, [1, 2, 3] и [11, 22, 33]. Необходимо создать
# третий список вида [1, 11, 2, 22, 3, 33]. Результаты вывести на экран.

_list1 = [1, 2, 3]
_list2 = [11, 22, 33]
_list3 = []
for i in range(len(_list1)):
    _list3.append(_list1[i])
    _list3.append(_list2[i])

print(_list3)
